{"class_name": "Sequential", "keras_version": "2.1.6-tf", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[3, 3], [3, 3]], "dtype": "float32", "trainable": true, "name": "conv1_pad", "data_format": "channels_last"}, "name": "conv1_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [7, 7]}, "name": "conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn_conv1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn_conv1"}, {"class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation"}, "name": "activation"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "dtype": "float32", "trainable": true, "name": "pool1_pad", "data_format": "channels_last"}, "name": "pool1_pad"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["pool1_pad", 0, 0, {}]]], "config": {"name": "max_pooling2d", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2a_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2a_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2a_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2a_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2a_branch2c"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2a_branch1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2a_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2a_branch1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2a_branch1"}, {"class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add"}, "name": "add"}, {"class_name": "Activation", "inbound_nodes": [[["add", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2b_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2b_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2b_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2b_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2b_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2b_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2b_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2b_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2b_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_3", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "name": "add_1"}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2c_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2c_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2c_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2c_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2c_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2c_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res2c_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn2c_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn2c_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_6", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "name": "add_2"}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3a_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3a_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3a_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3a_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3a_branch2c"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3a_branch1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3a_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3a_branch1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3a_branch1"}, {"class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "name": "add_3"}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3b_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3b_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3b_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3b_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3b_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3b_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3b_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3b_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3b_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_4"}, "name": "add_4"}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3c_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3c_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3c_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3c_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3c_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3c_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3c_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3c_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3c_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_15", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_5"}, "name": "add_5"}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3d_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3d_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3d_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3d_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3d_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3d_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res3d_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn3d_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn3d_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_18", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_6"}, "name": "add_6"}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn4a_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn4a_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn4a_branch2b", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn4a_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch2c", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res4a_branch2c"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4a_branch1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn4a_branch2c", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn4a_branch1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn4a_branch1"}, {"class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_7"}, "name": "add_7"}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4b_branch2a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "bn4b_branch2a", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "bn4b_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "res4b_branch2b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": 